# https://github.com/Homebrew/homebrew-bundle

# tap "homebrew/bundle"
# tap "homebrew/core"

tap "github/gh"
tap "heroku/brew"
tap "homebrew/services"
tap "minio/stable"
tap "nodenv/nodenv"
tap "rogual/neovim-dot-app"
tap "thoughtbot/formulae"

brew "git"
brew "git-extras"
brew "autojump"
brew "tmux"
brew "reattach-to-user-namespace"
brew "tig"
brew "youtube-dl"
brew "watchman"
brew "pandoc"
brew "vips"
brew "gh"
brew "hub"
brew "overmind"
brew "tree"
brew "openconnect"
brew "terraform"
brew "elasticsearch"
brew "ctags"
brew "jq"
brew "rsync"
brew "ripgrep"
brew "imagemagick"
brew "redis"
brew "azure-cli"
brew "awscli"
brew "aws-elasticbeanstalk"
brew "httpie"
brew "memcached"
brew "heroku"
brew "amazon-ecs-cli"
brew "git-delta"

tap "wallix/awless"
brew "awless"

# Version manager for Ruby
brew "rbenv"

brew "nodenv"

# May need to re-run `brew install vim` after installing Ruby with e.g. `asdf install ruby 2.6.5; asdf global ruby 2.6.5`, so it's compiled against the right Ruby.
# If https://github.com/asdf-vm/asdf/pull/575 is merged, try using that in the command above (to get latest Ruby without hard-coding a number into this file).
brew "vim"

# Find more with `brew search my_guess_at_the_name`.
cask "google-chrome"
cask "iterm2"
cask "spotify"
cask "zoomus"  # https://zoom.us
cask "mailplane"
cask "fantastical"
cask "alfred"
cask "istat-menus"
cask "imageoptim"
cask "licecap"
cask "dash"
cask "vlc"
cask "firefox"
cask "omnifocus"
cask "divvy"
cask "1password"
cask "dropbox"
cask "google-backup-and-sync"
cask "google-drive-file-stream"
cask "transmit"
cask "macvim"
cask "visual-studio-code"
cask "bartender"
cask "little-snitch"
cask "postgres"
cask "postico"
cask "daisydisk"
cask "timing"
cask "docker"
cask "postman"
cask "soulver"
cask "anki"
cask "notion"
cask "drawio"
cask "foldingtext"

# Mac App Store
# "Copy Link" from the App Store UI to get the ID.
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
mas "Kindle", id: 405399194
mas "Tadam", id: 531349534
mas "Noko Time Tracking", id: 879917538
mas "Amphetamine", id: 937984704
mas "Reeder 4", id: 1449412482
mas "NordVPN IKE", id: 1116599239
mas "Instapaper Save", id: 1481302432
mas "Marked 2", id: 890031187
