# https://github.com/Homebrew/homebrew-bundle

# tap "homebrew/bundle"
# tap "homebrew/core"

brew "git"
brew "autojump"

tap "wallix/awless"
brew "awless"

# Version manager for Ruby
brew "rbenv"

brew "nodenv"

# May need to re-run `brew install vim` after installing Ruby with e.g. `asdf install ruby 2.6.5; asdf global ruby 2.6.5`, so it's compiled against the right Ruby.
# If https://github.com/asdf-vm/asdf/pull/575 is merged, try using that in the command above (to get latest Ruby without hard-coding a number into this file).
brew "vim"

brew "tmux"
brew "reattach-to-user-namespace"
brew "tig"

# Find more with `brew search my_guess_at_the_name`.
cask "google-chrome"
cask "iterm2"
cask "spotify"
cask "zoomus"  # https://zoom.us
cask "mailplane"
cask "fantastical"
cask "alfred"
cask "istat-menus"
cask "imageoptim"
cask "licecap"
cask "dash"
cask "vlc"
cask "firefox"
cask "omnifocus"
cask "divvy"
cask "1password"
cask "dropbox"
cask "google-backup-and-sync"
cask "google-drive-file-stream"
cask "transmit"
cask "macvim"
cask "visual-studio-code"

# Mac App Store
# "Copy Link" from the App Store UI to get the ID.
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
mas "Kindle", id: 405399194
mas "Tadam", id: 531349534
mas "Noko Time Tracking", id: 879917538
mas "Amphetamine", id: 937984704
mas "Reeder 4", id: 1449412482
mas "NordVPN IKE", id: 1116599239
